[
  {
    "category": "anatomy",
    "content": "The permanent dentition consists of 32 teeth: 8 incisors, 4 canines, 8 premolars, and 12 molars (including 4 wisdom teeth). Each tooth has a specific function in the process of mastication and speech.",
    "tags": ["dentition", "teeth", "permanent", "anatomy", "dental", "structure"],
    "source": "Dental Anatomy and Physiology",
    "reference": "Wheeler's Dental Anatomy, Physiology, and Occlusion, 10th Edition"
  },
  {
    "category": "pathology",
    "content": "Dental caries (tooth decay) is a multifactorial disease caused by bacteria in dental plaque that ferment carbohydrates to produce acid, which demineralizes tooth structure. The demineralization process begins at the outer enamel and can progress to dentin and eventually the pulp if untreated.",
    "tags": ["caries", "decay", "cavity", "demineralization", "enamel", "dentin"],
    "source": "Oral Pathology",
    "reference": "Essentials of Oral Pathology and Oral Medicine, 8th Edition"
  },
  {
    "category": "treatments",
    "content": "Composite restorations (tooth-colored fillings) involve the removal of decayed tooth structure followed by placement of a tooth-colored resin material. This material is bonded to the tooth using adhesive systems and then cured with a blue light. Indications include small to moderate sized carious lesions, especially in areas where aesthetics is a concern.",
    "tags": ["composite", "restoration", "filling", "caries", "treatment", "esthetic"],
    "source": "Operative Dentistry",
    "reference": "Sturdevant's Art and Science of Operative Dentistry, 7th Edition"
  },
  {
    "category": "medications",
    "content": "Amoxicillin is a first-line antibiotic for dental infections. For adult dental infections, the typical dosage is 500mg three times daily for 7 days. It is effective against most oral pathogens but may be combined with clavulanic acid (Augmentin) for broader coverage when beta-lactamase producing organisms are suspected.",
    "tags": ["antibiotic", "amoxicillin", "infection", "prescription", "dosage"],
    "source": "Pharmacology",
    "reference": "Applied Pharmacology for the Dental Hygienist, 8th Edition"
  },
  {
    "category": "procedures",
    "content": "Root canal treatment (endodontic therapy) involves removing inflamed or infected pulp tissue from the tooth, cleaning and shaping the canal system, and filling the space with a biocompatible material (usually gutta-percha). The procedure is typically performed under local anesthesia and may require multiple appointments depending on complexity. Success rates exceed 90% when properly performed.",
    "tags": ["endodontics", "root canal", "pulp", "infection", "gutta-percha"],
    "source": "Endodontics",
    "reference": "Cohen's Pathways of the Pulp, 12th Edition"
  },
  {
    "category": "diagnostics",
    "content": "Pulp vitality testing includes thermal tests (cold, heat), electric pulp testing, and direct dentin stimulation. Cold tests using refrigerant spray or ice are most commonly used for initial testing. A lingering pain response (>10 seconds) to cold suggests irreversible pulpitis, while no response suggests pulp necrosis. These tests should be used in conjunction with radiographic and clinical findings.",
    "tags": ["pulp testing", "diagnosis", "cold test", "vitality", "irreversible pulpitis"],
    "source": "Endodontics",
    "reference": "Cohen's Pathways of the Pulp, 12th Edition"
  },
  {
    "category": "materials",
    "content": "Glass ionomer cements are water-based materials that bond chemically to tooth structure and release fluoride. They have properties intermediate between dental cements and dental restorative materials. Advantages include chemical adhesion to tooth structure, fluoride release, and thermal expansion similar to tooth structure. Disadvantages include low fracture resistance and poor aesthetics compared to composite resins.",
    "tags": ["glass ionomer", "cement", "restoration", "fluoride", "material"],
    "source": "Dental Materials",
    "reference": "Phillips' Science of Dental Materials, 12th Edition"
  },
  {
    "category": "instruments",
    "content": "Periodontal probes are calibrated instruments used to measure pocket depths around teeth. The WHO probe has a 0.5mm ball tip and markings at 3.5, 5.5, 8.5, and 11.5mm. The UNC-15 probe has 1mm markings to 15mm and is often used in research and for comprehensive periodontal assessment. Proper probing technique involves inserting the probe with gentle pressure (20-25g force) parallel to the long axis of the tooth.",
    "tags": ["periodontal probe", "pocket depth", "measurement", "UNC-15", "WHO probe"],
    "source": "Periodontics",
    "reference": "Carranza's Clinical Periodontology, 13th Edition"
  },
  {
    "category": "radiology",
    "content": "Periapical radiographs show the entire tooth from crown to apex, including surrounding bone. They are indicated for detecting periapical lesions, root fractures, and evaluating periodontal bone loss. The paralleling technique is preferred over the bisecting angle technique as it produces less distortion. Digital sensors require approximately 50-80% less radiation compared to traditional D-speed film.",
    "tags": ["periapical", "radiograph", "x-ray", "diagnosis", "paralleling technique"],
    "source": "Dental Radiology",
    "reference": "Oral Radiology: Principles and Interpretation, 8th Edition"
  },
  {
    "category": "periodontics",
    "content": "Chronic periodontitis is characterized by inflammation of the supporting tissues of the teeth, progressive attachment loss, and bone loss. It is associated with the presence of subgingival plaque and calculus. Clinical features include increased probing depths (>3mm), bleeding on probing, recession, mobility, and radiographic bone loss. Risk factors include poor oral hygiene, smoking, diabetes, genetic factors, and systemic diseases affecting host response.",
    "tags": ["periodontitis", "bone loss", "attachment loss", "periodontal disease", "inflammation"],
    "source": "Periodontics",
    "reference": "Carranza's Clinical Periodontology, 13th Edition"
  }
] 